content-org/all-posts.org
#+hugo_base_dir: ../
#+hugo_section:


** TODO Your brain is a nutrition accountant
:PROPERTIES:
:EXPORT_FILE_NAME: brain-is-a-nutrition-accountant
:EXPORT_HUGO_CUSTOM_FRONT_MATTER: :featured_image /img/featured_brain_accountant.jpg
:EXPORT_DATE: 2023-04-
:EXPORT_HUGO_TAGS: Food
:END:

Have you ever seen a fat giraffe? No, me neither. Not even in a zoo. 

The fact that animals in the wild don’t get overweight is often chalked up to the fact that they get a lot of physical activity. But the same seems to apply to animals in zoos, in their miniature enclosures. 

Yet maintaining a healthy body weight is so difficult for us humans. And for a lot of animals living with us too, like our cats and dogs.


*** Staying thin is hard, losing weight harder

Did you know that statistically speaking, someone trying to lose weight has chance of succeeding?

